Reports/КСУ_ВедомостьПоОтложенномуДоходу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>КСУ_ВедомостьПоОтложенномуДоходу</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_ДоходыБудущихПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ДоходыБудущихПериодов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияСсылка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСУ_ОперацииПоФондам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФондЗаемщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЗайма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ИА_ИсточникиСпецДохода</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаймыСФондов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаймыСФондов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьДолг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПричинаЗайма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_ПричиныЗайма</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникОтложенногоДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ИсточникиСпецДохода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_Займы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/КСУ_ОперацииСОтложеннымДоходом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ОперацииСОтложеннымДоходом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отложить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вернуть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КСУ_ОперацииПоФондам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ОперацииПоФондам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнедоходноеПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноИзДохода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвращеноВДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаливкаФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставлениеЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВыданногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПолученногоЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеСДругогоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВДругойФонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямаяВыплатаИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаПоЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КСУ_ВедомостьПоОтложенномуДоходу/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	ИспПодр = Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
	ДоходыПоПодр = Константы.КСУ_ДоходыПоПодразделениям.Получить();

	ТабДок.Очистить();
	
	отч = РеквизитФормыВЗначение("Отчет");
	макет = отч.ПолучитьМакет("Макет");
	
	Обл = макет.ПолучитьОбласть("Шапка");
	обл.параметры.ДатаОтчета = ТекущаяДата();
	обл.параметры.Период = формат(ДатаНачала,"ДФ=dd.MM.yyyy") + " - " + формат(ДатаКонца,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	ВыбВидыДох = Новый массив;
	Для каждого стр из ВидыДохода Цикл
		Если стр.выбрать Тогда
			ВыбВидыДох.Добавить(стр.ВидДохода);
		КонецЕсли;
	КонецЦикла;
	ВсеВидыДох = ВыбВидыДох.Количество() = ВидыДохода.Количество();
	
	ВыбОрганизации = Новый массив;
	Для каждого стр из Организации Цикл
		Если стр.выбрать Тогда
			ВыбОрганизации.Добавить(стр.Организация);
		КонецЕсли;
	КонецЦикла;
	
	ВыбФонды = Новый массив;
	Для каждого стр из Фонды Цикл
		Если стр.выбрать Тогда
			ВыбФонды.Добавить(стр.фонд);
		КонецЕсли;
	КонецЦикла;
	ВсеФонды = ВыбФонды.Количество() = Фонды.Количество();

		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("ДатаКонца1", КонецДня(ДатаКонца) + 1);
	Запрос.УстановитьПараметр("ВидыДоходов", ВыбВидыДох);
	Запрос.УстановитьПараметр("Организации", ВыбОрганизации);
	Запрос.УстановитьПараметр("Фонды", ВыбФонды);
	Запрос.УстановитьПараметр("Отложить", Перечисления.КСУ_ОперацииСОтложеннымДоходом.Отложить);	
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(ДатаКонца));
	тз_ВсеДанные = ПолучитьСводныеДанные(запрос);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаНачала);
	тз_ВсеДанныеВходящие = ПолучитьСводныеДанные(запрос);
	
	тз_Должники = ПолучитьДанныеДолжников(запрос, тз_всеДанные);
	
	Если Настройки[0].Выбрать Тогда // Сводно по организациям
		ВывестиСводныеПоОрганизациям(тз_ВсеДанные, макет, табдок, ИспПодр, ДатаКонца);
	КонецЕсли;
	
	для каждого стрОрг из Организации Цикл
		если не стрОрг.Выбрать тогда
			Продолжить;
		КонецЕсли;
		
		/////////// ОРГАНИЗАЦИЯ
		Обл = макет.ПолучитьОбласть("ГруппаОрганизация");
		обл.параметры.Организация = стрОрг.Организация;
		ТабДок.Вывести(обл);
		
		Запрос.УстановитьПараметр("Организация", стрОрг.Организация);
		
		ДанныеПоОрг = тз_ВсеДанные.Скопировать();
		Сч = ДанныеПоОрг.Количество() - 1;
		Пока сч >=0 Цикл
			если ДанныеПоОрг[сч].Организация <> стрОрг.Организация Тогда
				ДанныеПоОрг.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
		
		Если ДанныеПоОрг.Количество() = 0 ТОгда
			Обл = макет.ПолучитьОбласть("ОрганизацияНетДвижений");
			ТабДок.Вывести(обл);
			Продолжить;;
		КонецЕсли;
		
		Тз_Подр = ДанныеПоОрг.Скопировать();
		Тз_Подр.Свернуть("Подразделение");
		Если не ДоходыПоПодр тогда
			Тз_Подр.очистить();
			Тз_Подр.Добавить();
		КонецЕсли;
		
		Для каждого стрПодр из  Тз_Подр Цикл
			
			Если ДоходыПоПодр тогда
				Обл = макет.ПолучитьОбласть("Подразделение");
				обл.параметры.Подразделение = стрПодр.Подразделение;
				ТабДок.Вывести(обл);
			КонецЕсли;
			
			ДанныеПоОргПодр = ДанныеПоОрг.Скопировать();
			Если ДоходыПоПодр Тогда
				Сч = ДанныеПоОргПодр.Количество() - 1;
				Пока сч >=0 Цикл
					если ДанныеПоОргПодр[сч].Подразделение <> стрПодр.Подразделение Тогда
						ДанныеПоОргПодр.Удалить(сч);
					КонецЕсли;				
					сч = сч - 1;
				КонецЦикла;
			КонецЕсли;

			ДанныеПоОрг_вх = тз_ВсеДанныеВходящие.Скопировать();
			Сч = ДанныеПоОрг_вх.Количество() - 1;
			Пока сч >=0 Цикл
				если ДанныеПоОрг_вх[сч].Организация <> стрОрг.Организация или (ДоходыПоПодр и ДанныеПоОрг_вх[сч].Подразделение <> стрПодр.Подразделение) Тогда
					ДанныеПоОрг_вх.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			ДанныеПоОргДолжники = тз_Должники.Скопировать();
			Сч = ДанныеПоОргДолжники.Количество() - 1;
			Пока сч >=0 Цикл
				если ДанныеПоОргДолжники[сч].Организация <> стрОрг.Организация или (ДоходыПоПодр и ДанныеПоОргДолжники[сч].Подразделение <> стрПодр.Подразделение) Тогда
					ДанныеПоОргДолжники.Удалить(сч);
				КонецЕсли;				
				сч = сч - 1;
			КонецЦикла;
			
			//
			Если Настройки[1].Выбрать Тогда // сводно по операциям
				ВывестиСводныеПоОперациям(ДанныеПоОргПодр, макет, табдок, ИспПодр, ДатаКонца);
			КонецЕсли;
			
			//
			Если Настройки[2].Выбрать Тогда // Сводно по операциям (группировка по виду дохода)
				ВывестиСводныеПоОперациямПоВидамДохода(ДанныеПоОргПодр, макет, табдок, ИспПодр, ДатаКонца);
			КонецЕсли;
			
			//
			Если Настройки[3].Выбрать Тогда // Список фондов-должников (группировка по фондам)
				ВывестиДолжниковПоФондам(ДанныеПоОргДолжники, макет, табдок, ИспПодр, ДатаКонца);
			КонецЕсли;
			
			//
			Если Настройки[4].Выбрать Тогда // Список фондов-должников (группировка по операциям)
				ВывестиДолжниковПоОперациям(ДанныеПоОргДолжники, макет, табдок, ИспПодр, ДатаКонца);
			КонецЕсли;
			
			//
			Если Настройки[5].Выбрать Тогда // Детализация 
				ВывестиДетализацию(запрос, ДанныеПоОрг, ДанныеПоОрг_вх, макет, табдок, ИспПодр, ДатаКонца, Сортировка)
			КонецЕсли;

		КонецЦикла; // по подразделениям
	КонецЦикла; // по организациям
	
	Обл = макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(обл);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	Элементы.ТабДок.РежимМасштабированияПросмотра = РежимМасштабированияПросмотра.Обычный;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСводныеПоОрганизациям(тз_ВсеДанные, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);

	тз_ПоОрг = тз_ВсеДанные.Скопировать();
	тз_ПоОрг.Свернуть("Организация", "Отложено,Возвращено,ВЗаймах,ДоступноДляВозврата,НужноВернуть");
	
	Если тз_ПоОрг.Количество() = 0 ТОгда
		Обл = макет.ПолучитьОбласть("СводныеНетДвижений");
		обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(обл);
		возврат;
	КонецЕсли;
	
	Обл = макет.ПолучитьОбласть("СводныеШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	Для каждого стр из тз_ПоОрг Цикл
		Обл = макет.ПолучитьОбласть("СводныеСтрока");
		ЗаполнитьЗначенияСвойств(обл.параметры, стр);
		ТабДок.Вывести(обл);
	КонецЦикла;
	
	Обл = макет.ПолучитьОбласть("СводныеИтого");
	обл.параметры.Отложено = тз_ПоОрг.Итог("Отложено");
	обл.параметры.Возвращено = тз_ПоОрг.Итог("Возвращено");
	обл.параметры.ВЗаймах = тз_ПоОрг.Итог("ВЗаймах");
	обл.параметры.ДоступноДляВозврата = тз_ПоОрг.Итог("ДоступноДляВозврата");
	обл.параметры.НужноВернуть = тз_ПоОрг.Итог("НужноВернуть");
	ТабДок.Вывести(обл);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСводныеПоОперациям(тз_Данные, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
		
	Обл = макет.ПолучитьОбласть("СводныеПоОперациямШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	Для каждого стр из тз_Данные Цикл
		Обл = макет.ПолучитьОбласть("СводныеПоОперациямСтрока");
		ЗаполнитьЗначенияСвойств(обл.параметры, стр);
		
		РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стр.Источник, КонецДня(ДатаКонца));
		ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
		
		ТабДок.Вывести(обл);
	КонецЦикла;
	
	Обл = макет.ПолучитьОбласть("СводныеПоОперациямИтого");
	обл.параметры.Отложено = тз_Данные.Итог("Отложено");
	обл.параметры.Возвращено = тз_Данные.Итог("Возвращено");
	обл.параметры.ВЗаймах = тз_Данные.Итог("ВЗаймах");
	обл.параметры.ДоступноДляВозврата = тз_Данные.Итог("ДоступноДляВозврата");
	обл.параметры.НужноВернуть = тз_Данные.Итог("НужноВернуть");
	ТабДок.Вывести(обл);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиСводныеПоОперациямПоВидамДохода(тз_Данные, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
		
	Обл = макет.ПолучитьОбласть("СводныеПоОперациямПоВДШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	тз_видДохода = тз_Данные.Скопировать();
	тз_видДохода.Свернуть("ВидДохода","Отложено,Возвращено,ВЗаймах,ДоступноДляВозврата,НужноВернуть");
	
	Для каждого стрДоход из тз_видДохода цикл
		тзОперации = тз_Данные.Скопировать();
		Сч = тзОперации.Количество() - 1;
		Пока сч >=0 Цикл
			если тзОперации[сч].ВидДохода <> стрДоход.ВидДохода Тогда
				тзОперации.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
				
		Обл = макет.ПолучитьОбласть("СводныеПоОперациямПоВДВидДохода");
		ЗаполнитьЗначенияСвойств(обл.параметры, стрДоход);
		ТабДок.Вывести(обл);
			
		Для каждого стр из тзОперации Цикл
			Обл = макет.ПолучитьОбласть("СводныеПоОперациямПоВДСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стр);
			
			РегистраторыСтрукт = ПолучитьПредставлениеРегистраторов(стр.Источник, КонецДня(ДатаКонца));
			ЗаполнитьЗначенияСвойств(обл.параметры, РегистраторыСтрукт);
		
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("СводныеПоОперациямПоВДИтого");		
		обл.параметры.ДоступноДляВозврата = тзОперации.Итог("ДоступноДляВозврата");
		обл.параметры.НужноВернуть = тзОперации.Итог("НужноВернуть");
		ТабДок.Вывести(обл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДолжниковПоФондам(тз_Данные, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
		
	Обл = макет.ПолучитьОбласть("ДолжникиШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	тз_Фонды = тз_Данные.Скопировать();
	тз_Фонды.Свернуть("Фонд","Долг");
	
	Для каждого стрФонд из тз_Фонды цикл
		тзОперации = тз_Данные.Скопировать();
		Сч = тзОперации.Количество() - 1;
		Пока сч >=0 Цикл
			если тзОперации[сч].Фонд <> стрФонд.Фонд Тогда
				тзОперации.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
				
		Обл = макет.ПолучитьОбласть("ДолжникиФонд");
		ЗаполнитьЗначенияСвойств(обл.параметры, стрФонд);
		ТабДок.Вывести(обл);
			
		Для каждого стр из тзОперации Цикл
			Обл = макет.ПолучитьОбласть("ДолжникиСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стр);		
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДолжникиИтого");		
		обл.параметры.Долг = тзОперации.Итог("Долг");
		ТабДок.Вывести(обл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДолжниковПоОперациям(тз_Данные, макет, табдок, ИспПодр, ДатаКонца)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
		
	Обл = макет.ПолучитьОбласть("ДолжникиПоОтлШапка");
	обл.параметры.ДатаКонца = формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(обл);
	
	тз_Операции = тз_Данные.Скопировать();
	тз_Операции.Свернуть("ИсточникОтложенногоДохода,ИД,Отложено,КомментарийОткладывания,ДатаОткл,Срок,ВидДохода,Возвращено,НужноВернуть","Долг");
	
	Для каждого стрОперация из тз_Операции цикл
		тзФонды = тз_Данные.Скопировать();
		Сч = тзФонды.Количество() - 1;
		Пока сч >=0 Цикл
			если тзФонды[сч].ИсточникОтложенногоДохода <> стрОперация.ИсточникОтложенногоДохода Тогда
				тзФонды.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
					
		Обл = макет.ПолучитьОбласть("ДолжникиПоОтлОперация");
		обл.параметры.Операция1 = стрОперация.ИД + " (" + формат(стрОперация.Отложено, "ЧДЦ=2") + " руб.) " + стрОперация.КомментарийОткладывания;
		обл.параметры.Операция2 = "Отложено " + формат(стрОперация.ДатаОткл,"ДФ=dd.MM.yyyy") + " до " + формат(стрОперация.Срок, "ДФ=dd.MM.yyyy") + " с дохода """ + стрОперация.ВидДохода + """. Возвращено в доход "+формат(стрОперация.Возвращено, "ЧДЦ=2")+" руб., осталось вернуть "+формат(стрОперация.НужноВернуть, "ЧДЦ=2")+" руб.";
		ТабДок.Вывести(обл);
			
		Для каждого стр из тзФонды Цикл
			Обл = макет.ПолучитьОбласть("ДолжникиПоОтлСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стр);		
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДолжникиПоОтлИтого");		
		обл.параметры.Долг = стрОперация.Долг;
		ТабДок.Вывести(обл);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиДетализацию(запрос, тз_Данные_исх, тз_Данные_вх, макет, табдок, ИспПодр, ДатаКонца, сортировка)
	
	Обл = макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДок.Вывести(обл);
	
	
	тз_Данные = ПолучитьДанныеДетализации(запрос);
	
	Если тз_Данные.Количество() = 0 ТОгда
		Обл = макет.ПолучитьОбласть("ДетализацияНетДвижений");
		ТабДок.Вывести(обл);
		возврат;
	КонецЕсли;
	

	Обл = макет.ПолучитьОбласть("ДетализацияШапка");
	ТабДок.Вывести(обл);
	
	Если сортировка = 0 Тогда
		тз_Данные.Сортировать("Период");
	ИНачеЕсли сортировка = 1 Тогда
		тз_Данные.Сортировать("Операция");
	ИначеЕсли сортировка = 2 Тогда
		тз_Данные.Сортировать("Фонд");
	КонецЕсли;
	
	тз_Источники = тз_Данные.Скопировать();
	тз_Источники.Свернуть("Источник");
	
	НулСтрока = Новый Структура("НужноВернуть,ВЗаймах,ДоступноДляВозврата",0,0,0);
	
	Для каждого СтрИсточник из тз_Источники цикл
		
		Обл = макет.ПолучитьОбласть("ДетализацияШапкаИД");
		СтрДанныеИсх = тз_Данные_исх.найти(СтрИсточник.Источник, "Источник");
		Если СтрДанныеИсх<>Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДанныеИсх);
			Обл.Параметры.ДатаОткл = Формат(СтрДанныеИсх.ДатаОткл,"ДФ=dd.MM.yyyy");
			Обл.Параметры.Срок = Формат(СтрДанныеИсх.Срок,"ДФ=dd.MM.yyyy");
		КонецЕсли;
		ТабДок.Вывести(обл);
	
		тзОперации = тз_Данные.Скопировать();
		Сч = тзОперации.Количество() - 1;
		Пока сч >=0 Цикл
			если тзОперации[сч].Источник <> СтрИсточник.Источник Тогда
				тзОперации.Удалить(сч);
			КонецЕсли;				
			сч = сч - 1;
		КонецЦикла;
					
		Обл = макет.ПолучитьОбласть("ДетализацияВхОстаток");
		СтрДанныеВх = тз_Данные_вх.найти(СтрИсточник.Источник, "Источник");
		Если СтрДанныеВх <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДанныеВх);
			Обл.Параметры.ВЗаймах = - СтрДанныеВх.ВЗаймах;
		Иначе
			ЗаполнитьЗначенияСвойств(Обл.Параметры, НулСтрока);
		КонецЕсли;
		ТабДок.Вывести(обл);
		
		Если СтрДанныеВх <> Неопределено Тогда
			Доступно = СтрДанныеВх.ДоступноДляВозврата;
			НужноВернуть = СтрДанныеВх.НужноВернуть;
		Иначе
			Доступно = 0;
			НужноВернуть = 0;
		КонецЕсли;
			
		Для каждого стр из тзОперации Цикл
			Обл = макет.ПолучитьОбласть("ДетализацияСтрока");
			ЗаполнитьЗначенияСвойств(обл.параметры, стр);
			
			Если стр.Операция = Перечисления.КСУ_ОперацииПоФондам.ОтложеноИзДохода Тогда
				обл.параметры.Возвращено = стр.Сумма;
				
				Доступно = Доступно + стр.Сумма;
				НужноВернуть = НужноВернуть + стр.Сумма;
			ИначеЕсли стр.Операция = Перечисления.КСУ_ОперацииПоФондам.ВозвращеноВДоход Тогда
				обл.параметры.Комментарий_Возврата = стр.КомментарийДохода;
				обл.параметры.Возвращено = -стр.Сумма;
				
				Доступно = Доступно - стр.Сумма;
				НужноВернуть = НужноВернуть - стр.Сумма;
			ИначеЕсли стр.Операция = Перечисления.КСУ_ОперацииПоФондам.ПрямаяВыплатаИзФонда Тогда
				обл.параметры.Возвращено = -стр.Сумма;
				обл.параметры.Операция = "Возврат покупателю";
				
				Доступно = Доступно - стр.Сумма;
				НужноВернуть = НужноВернуть - стр.Сумма;
			ИначеЕсли стр.Операция = Перечисления.КСУ_ОперацииПоФондам.ПредоставлениеЗайма Тогда
				обл.параметры.Комментарий_Займа = стр.КомментарийЗайма;
				обл.параметры.Займ = -стр.Сумма;
				
				Доступно = Доступно - стр.Сумма;
			ИначеЕсли стр.Операция = Перечисления.КСУ_ОперацииПоФондам.ВозвратВыданногоЗайма Тогда
				обл.параметры.Комментарий_Возврата = стр.КомментарийЗайма;
				обл.параметры.Займ = стр.Сумма;
				
				Доступно = Доступно + стр.Сумма;
			КонецЕсли;
			
			обл.параметры.ДоступноДляВозврата = Доступно;
			обл.параметры.НужноВернуть = НужноВернуть;
			ТабДок.Вывести(обл);
		КонецЦикла;
		
		Обл = макет.ПолучитьОбласть("ДетализацияИсхОстаток");
		Если СтрДанныеИсх <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Обл.Параметры, СтрДанныеИсх);
			Обл.Параметры.ВЗаймах = - СтрДанныеИсх.ВЗаймах;
		Иначе
			ЗаполнитьЗначенияСвойств(Обл.Параметры, НулСтрока);
		КонецЕсли;
		ТабДок.Вывести(обл);
	КонецЦикла;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеДетализации(запрос)
	Запрос.текст = "ВЫБРАТЬ
	               |	дбп.Подразделение КАК Подразделение,
	               |	дбп.ВидДохода КАК ВидДохода,
	               |	дбп.СуммаБезнал КАК Сумма,
	               |	дбп.Источник КАК Источник,
	               |	дбп.Источник.ДатаОперации КАК ДатаОткл,
	               |	дбп.Источник.ДоДаты КАК Срок,
	               |	дбп.Источник.НаименованиеИД КАК ИД_Представление,
	               |	дбп.Источник.Комментарий КАК КомментарийДохода,
	               |	дбп.ОперацияСсылка КАК Операция,
	               |	дбп.ФондЗаемщик КАК Фонд,
	               |	дбп.КомментарийЗайма КАК КомментарийЗайма,
	               |	дбп.Период КАК Период,
	               |	дбп.Регистратор КАК ФПСсылка,
	               |	дбп.Регистратор.Номер КАК ФП
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов КАК дбп
	               |ГДЕ
	               |	дбп.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |	И дбп.Организация = &Организация
	               |	И (дбп.ФондЗаемщик В (&Фонды)
	               |			ИЛИ дбп.ФондЗаемщик = ЗНАЧЕНИЕ(Справочник.ИА_фонды.ПустаяСсылка))";
	
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДолжников(запрос, тз_всеДанные)
	Запрос.текст = "ВЫБРАТЬ
	               |	тз_всеДанные.Организация КАК Организация,
	               |	тз_всеДанные.Источник КАК Источник,
	               |	тз_всеДанные.ВидДохода КАК ВидДохода,
	               |	тз_всеДанные.ДатаОткл КАК ДатаОткл,
	               |	тз_всеДанные.Срок КАК Срок,
	               |	тз_всеДанные.ИД КАК ИД,
	               |	тз_всеДанные.Комментарий КАК КомментарийОткладывания,
	               |	тз_всеДанные.Отложено КАК Отложено,
	               |	тз_всеДанные.Возвращено КАК Возвращено,
	               |	тз_всеДанные.НужноВернуть КАК НужноВернуть
	               |ПОМЕСТИТЬ тз_всеДанные
	               |ИЗ
	               |	&тз КАК тз_всеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ЗаймыСФондовОстатки.Организация КАК Организация,
	               |	ИА_ЗаймыСФондовОстатки.НаФонд КАК Фонд,
	               |	ИА_ЗаймыСФондовОстатки.НаПодразделение КАК НаПодразделение,
	               |	ИА_ЗаймыСФондовОстатки.ИсточникОтложенногоДохода КАК ИсточникОтложенногоДохода,
	               |	ИА_ЗаймыСФондовОстатки.ид.ПричинаЗайма КАК идПричинаЗайма,
	               |	ИА_ЗаймыСФондовОстатки.ид.КрайнийСрок КАК СрокЗайма,
	               |	ИА_ЗаймыСФондовОстатки.ид.Комментарий КАК КомментарийЗайма,
	               |	ИА_ЗаймыСФондовОстатки.СуммаБезналОстаток КАК Долг,
	               |	тз_всеДанные.ВидДохода КАК ВидДохода,
	               |	тз_всеДанные.ДатаОткл КАК ДатаОткл,
	               |	тз_всеДанные.Срок КАК Срок,
	               |	тз_всеДанные.ИД КАК ИД,
	               |	тз_всеДанные.КомментарийОткладывания КАК КомментарийОткладывания,
	               |	тз_всеДанные.Отложено КАК Отложено,
	               |	тз_всеДанные.Возвращено КАК Возвращено,
	               |	тз_всеДанные.НужноВернуть КАК НужноВернуть,
	               |	ИА_ЗаймыСФондовОстатки.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрНакопления.ИА_ЗаймыСФондов.Остатки(&ДатаКонца1, ) КАК ИА_ЗаймыСФондовОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тз_всеДанные КАК тз_всеДанные
	               |		ПО (тз_всеДанные.Источник = ИА_ЗаймыСФондовОстатки.ИсточникОтложенногоДохода)
	               |			И (тз_всеДанные.Источник <> НЕОПРЕДЕЛЕНО)";
	Запрос.УстановитьПараметр("тз", тз_всеДанные);
	
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСводныеДанные(запрос)
	Запрос.текст = "ВЫБРАТЬ
	               |	Подзапрос.Источник КАК Источник,
	               |	МИНИМУМ(Подзапрос.Ссылка) КАК ФП
	               |ПОМЕСТИТЬ ФПшки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИА_ФинансовоеПланированиеДоходыБП.Источник КАК Источник,
	               |		ИА_ФинансовоеПланированиеДоходыБП.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ДоходыБП КАК ИА_ФинансовоеПланированиеДоходыБП
	               |	ГДЕ
	               |		ИА_ФинансовоеПланированиеДоходыБП.Ссылка.Проведен
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ИА_ФинансовоеПланированиеОтложенныйДоход.ид,
	               |		ИА_ФинансовоеПланированиеОтложенныйДоход.Ссылка
	               |	ИЗ
	               |		Документ.ИА_ФинансовоеПланирование.ОтложенныйДоход КАК ИА_ФинансовоеПланированиеОтложенныйДоход
	               |	ГДЕ
	               |		ИА_ФинансовоеПланированиеОтложенныйДоход.Ссылка.Проведен
	               |		И ИА_ФинансовоеПланированиеОтложенныйДоход.ТипОперации = &Отложить) КАК Подзапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Подзапрос.Источник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ДоходыБудущихПериодовОбороты.Организация КАК Организация,
	               |	ИА_ДоходыБудущихПериодовОбороты.Подразделение КАК Подразделение,
	               |	ИА_ДоходыБудущихПериодовОбороты.ВидДохода КАК ВидДохода,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналПриход КАК СуммаБезналПриход,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналРасход КАК СуммаБезналРасход,
	               |	ИА_ДоходыБудущихПериодовОбороты.Источник КАК Источник,
	               |	ИА_ДоходыБудущихПериодовОбороты.Источник.ДатаОперации КАК ДатаОткл,
	               |	ИА_ДоходыБудущихПериодовОбороты.Источник.ДоДаты КАК Срок,
	               |	ИА_ДоходыБудущихПериодовОбороты.Источник.НаименованиеИД КАК ИД,
	               |	ИА_ДоходыБудущихПериодовОбороты.Источник.Комментарий КАК Комментарий,
	               |	ФПшки.ФП КАК ФПСсылка,
	               |	ФПшки.ФП.Номер КАК ФП,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналПриход - ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналРасход, 0) КАК Отложено,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналРасход - ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналПриход, 0) КАК Возвращено,
	               |	ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналКонечныйОстаток, 0) КАК ВЗаймах,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналКонечныйОстаток КАК ДоступноДляВозврата,
	               |	ИА_ДоходыБудущихПериодовОбороты.СуммаБезналКонечныйОстаток + ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналКонечныйОстаток, 0) КАК НужноВернуть,
	               |	ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналПриход, 0) КАК ЗанялиВФонды,
	               |	ЕСТЬNULL(ИА_ЗаймыСФондовОбороты.СуммаБезналРасход, 0) КАК ВернулиИзФондов
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов.ОстаткиИОбороты(, &ДатаСреза, , , Организация В (&Организации)) КАК ИА_ДоходыБудущихПериодовОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_ЗаймыСФондов.ОстаткиИОбороты(, &ДатаСреза, , , ) КАК ИА_ЗаймыСФондовОбороты
	               |		ПО ИА_ДоходыБудущихПериодовОбороты.Источник = ИА_ЗаймыСФондовОбороты.ИсточникОтложенногоДохода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФПшки КАК ФПшки
	               |		ПО (ФПшки.Источник = ИА_ДоходыБудущихПериодовОбороты.Источник)";
	
	Возврат запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеРегистраторов(идОтлДохода, доДаты)
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ИА_ДоходыБудущихПериодовОбороты.Регистратор КАК Регистратор,
	               |	ИА_ДоходыБудущихПериодовОбороты.Регистратор.Номер КАК Номер
	               |ИЗ
	               |	РегистрНакопления.ИА_ДоходыБудущихПериодов.Обороты(, &ДоДаты, Регистратор, Источник = &ид) КАК ИА_ДоходыБудущихПериодовОбороты";
	Запрос.УстановитьПараметр("ид", идОтлДохода);
	Запрос.УстановитьПараметр("доДаты", доДаты);
	Выборка = запрос.Выполнить().Выбрать();
	
	рез = "";
	масс = новый массив;
	Пока выборка.Следующий() цикл
		Если рез <> "" Тогда
			рез = рез + ", ";
		КонецЕсли;
				
		//Предст = "ФП №"+выборка.Номер;
		Предст = выборка.Номер;
				
		рез = рез + Предст;
		масс.Добавить(Выборка.Регистратор);
	КонецЦикла;
	
	РезСтрукт = Новый Структура("Регистраторы, ФПСсылка", рез, масс); 
	
	возврат РезСтрукт;
КонецФункции






&НаКлиенте
Процедура Сформировать(Команда)

	если ДатаНачала = Дата(1,1,1) или ДатаКонца = Дата(1,1,1) ТОгда
		ПоказатьПредупреждение(,"Заполните период отчета!");
		Возврат;
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНастройки();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по организациям";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по операциям";
	НовстрН.Выбрать = истина;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Сводно по операциям (группировка по виду дохода)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Список фондов-должников (группировка по фондам)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Список фондов-должников (группировка по операциям)";
	НовстрН.Выбрать = ложь;
	
	НовстрН = Настройки.Добавить();
	НовстрН.Настройка = "Детализация";
	НовстрН.Выбрать = ложь;
	
	//
	МассОрг = ИА_ФПСервер.ПолучитьОрганизацииДляОтчетов();
	Для каждого орг из МассОрг Цикл
		НовстрН = Организации.Добавить();
		НовстрН.Организация = орг;
		НовстрН.Выбрать = истина;
	КонецЦикла;
	Если не Константы.ИА_ФП_ВестиФППоОрганизациям.Получить() Тогда
		НовстрН = Организации.Добавить();
		НовстрН.Организация = Справочники.Организации.ПустаяСсылка();
		НовстрН.Выбрать = истина;
	КонецЕсли;
	
	//
	Выборка= Справочники.ИА_ВидыДоходов.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = ВидыДохода.Добавить();
			НовстрН.ВидДохода = Выборка.Ссылка;
			НовстрН.Выбрать = истина;
		КонецЕсли;
	КонецЦикла;
	
	//
	Выборка= Справочники.ИА_Фонды.Выбрать(,,,"Наименование");
	Пока выборка.Следующий() Цикл
		Если не выборка.ПометкаУдаления Тогда
			НовстрН = Фонды.Добавить();
			НовстрН.Фонд = Выборка.Ссылка;
			НовстрН.Выбрать = истина;
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьФильтры(Команда)
	Элементы.ГруппаПравая.Видимость = не Элементы.ГруппаПравая.Видимость;
	Элементы.ПоказатьСкрытьФильтры.Заголовок = ?(Элементы.ГруппаПравая.Видимость, "Скрыть фильтры", "Показать фильтры")
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбратьПриИзменении(Элемент)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Настройки1ВыбратьПриИзменении(Элемент)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);	
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВидыДоходаВыбратьПриИзменении(Элемент)
	Элементы.ГруппаВидыДохода.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыДохода Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаВидыДохода.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеНастройки(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Настройки Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехНастроек(Команда)
	Элементы.ГруппаНастройки.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Настройки Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеОрганизации(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Организации Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехОрганизаций(Команда)
	Элементы.ГруппаОрганизации.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Организации Цикл
		стр.выбрать = ложь;
	КонецЦикла;

	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсеВидыДохода(Команда)
	Элементы.ГруппаВидыДохода.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из ВидыДохода Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВыборСоВсехВидовДохода(Команда)
	Элементы.ГруппаВидыДохода.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из ВидыДохода Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры


&НаКлиенте
Процедура СброситьФильтры(Команда)
	ВыбратьВсеНастройки(Неопределено);
	ВыбратьВсеОрганизации(Неопределено);
	ВыбратьВсеВидыДохода(Неопределено);
	ВыбратьВсеФонды(Неопределено);
	
	Элементы.СброситьФильтры.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Скрыть();
	Элементы.ГруппаВидыДохода.Скрыть();
	Элементы.ГруппаНастройки.Скрыть();
	Элементы.ГруппаСортировка.Скрыть();
	Элементы.ГруппаФонды.Скрыть();
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьВсеГруппы(Команда)
	Элементы.ГруппаОрганизации.Показать();
	Элементы.ГруппаВидыДохода.Показать();
	Элементы.ГруппаНастройки.Показать();
	Элементы.ГруппаСортировка.Показать();
	Элементы.ГруппаФонды.Показать();
КонецПроцедуры


&НаКлиенте
Процедура pdf(Команда)
	Оповещение  = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
    ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогВыбора.ПолноеИмяФайла = "Ведомость по отложенному доходу "+ формат(ДатаНачала, "ДФ=dd.MM.yyyy") +"-" + формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	ДиалогВыбора.Расширение = "pdf";
    ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(МассивФайлов, ДопПараметры) Экспорт
    Если МассивФайлов = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ТабДок.Записать(МассивФайлов[0], ТипФайлаТабличногоДокумента.PDF);
КонецПроцедуры


&НаКлиенте
Процедура ФондыВыбратьПриИзменении(Элемент)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		если стр.выбрать = ложь тогда
			Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
			Элементы.СброситьФильтры.Видимость = истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеФонды(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(90, 150, 249);
	для каждого стр из Фонды Цикл
		стр.выбрать = истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыборСоВсехФондов(Команда)
	Элементы.ГруппаФонды.ЦветТекстаЗаголовка = новый цвет(255, 0, 0);
	для каждого стр из Фонды Цикл
		стр.выбрать = ложь;
	КонецЦикла;
	
	Элементы.СброситьФильтры.Видимость = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	если ТипЗнч(Расшифровка) = тип("Массив") Тогда
		СтандартнаяОбработка = ложь;
		
		сп = Новый СписокЗначений;
		сп.ЗагрузитьЗначения(Расшифровка);
		
		ОпОп = новый ОписаниеОповещения("ВыборРег", ЭтотОбъект);
		ПоказатьВыборИзСписка(ОпОп, сп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборРег(ВыбЗн, дп) Экспорт
	если ВыбЗн<>Неопределено Тогда
		ПоказатьЗначение(, ВыбЗн.Значение);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаКонца = ТекущаяДата();
	ДатаНачала = ДатаКонца - 60*60*24 * 7;
КонецПроцедуры
